supermemo_config.org
#+BRAIN_PARENTS: system
#+TITLE: Supermemo configuration
#+auto_tangle: t

This is my literate config detailing the installation and management of Supermemo under Wine - interfaced via Emacs.

Features:

- Automated installation of SM18 under Wine (mostly via ~supermemo-wine~)
- Emacs integration by the following means:
  + Emacs and EXWM X-window/buffer management
    - Reliable named buffers navigate-able through EXWM
    - =display-buffer-alist= rules for SM windows; allowing for declarative window arrangement
    - ~Burly~ bookmarking of SM views
  + Text-streams via =exwm-input--fake-key= (utilizing ~Autohotkey~ as a backend) allowing for
    - vIM-style modal bindings with NORMAL and Insert modes (EXWM).
    - Access to SM interface options as hydra-menus.
    - Item element editing in org buffers, with all markup converted back to HTML.

- Bridging functions between SMA, SM, and Emacs creating possibilities for:
  + Helm fuzzy lookup of elements based on their element-id
  + Org-mode card building, much like [[https://github.com/louietan/anki-editor][anki-editor]]
  + *Incremental video via mpv*, allowing for ~lua~ script based generation of gifs, extractions of subs.
  + *Incremental writing of email with ~mu4e~!*
  + *Incremental literate programming* with org-mode and SM's algorithm!


* Installation
:PROPERTIES:
:CREATED:  [2020-11-19 Thu 22:48]
:ID:       c5e3d6cf-81c6-47cf-9bf3-eff77b6a5270
:END:
This guide is meant as a 0-to-working playbook. Parts of it tangle to scripts and Elisp config files that may be opinionated and platform specific. One day it might exist as a Melpa package but for now should be treated as a walk-through.

The first hurdle is getting a working installation of SM18.
We'll be using allesivs [[https://github.com/alessivs/supermemo-wine][supermemo-wine]] .verb for the installation of SM18.

Cloning in the verbs:
#+begin_src sh
cd ~/Templates/sm
git clone https://github.com/alessivs/supermemo-wine.git
#+end_src

Make sure we have the correct wine version: https://dl.winehq.org/wine/source/5.x/

#+begin_src sh
wine --version
#+end_src

#+RESULTS:
: wine-5.2

#+begin_src sh :mkdirp yes :results silent
cd ~/Templates/sm/
curl -O https://dl.winehq.org/wine/source/5.x/wine-5.2.tar.xz
#+end_src

After installation of (the [[https://github.com/Winetricks/winetricks/issues/1593][correct]] version) Wine and Winetricks we can setup the =wineprefix= and install.
Something about the ~:dir sudo~ syntax isn't working
#+begin_src sh :dir /sudo::/vrika
cd ~/Templates/sm/
tar -xf wine-5.2.tar.xz
cd /wine-5.2
./configure
make
sudo make install
#+end_src

#+begin_src sh
env WINEARCH=win32 sh winetricks arch=32 prefix=supermemo18
sh winetricks prefix=supermemo18 ~/Templates/sm/supermemo-wine/verbs/supermemo18.verb
#+end_src

#+RESULTS:

* Setup SM window management
:PROPERTIES:
:CREATED:  [2020-10-09 Fri 18:15]
:ID:       5f96c370-eb26-4117-a7d8-43793e465c9d
:END:
By identifying and naming different SuperMemo window buffers, we can have a reliable way to target those buffers with text streams. Specifically, we can target a buffer with a simulated keypress, affording us a kind of poor-man's API by way of scripting window movement and key-chords in an orchistrated way.

** Capturing buffers
:PROPERTIES:
:CREATED:  [2020-11-20 Fri 10:39]
:ID:       8cf89b9a-bdb4-41a4-a3a9-4343be5c0ee6
:END:

A quirk of using SM under Wine is that a virtual desktop steals management of SM's windows and X naming scheme. In order to use text-streaming and window/buffer management with ~EXWM~ we want to be able to target named instances of the windows which will means we'll need to capture the buffer via =WM_TITLE= of individual windows.

We want to capture the following buffer titles with a regex so that we can move:
a. The Knowledge tree to the left of the screen.
b. The tray to the bottom, but not spanning the whole width of the screen.
c. Have the review buffer as the main window.
d. Have all other SM related windows as floating frames centered on the screen.

We'll use [[info:elisp#Rx][rx]] to handle the notation.

Example of the kinds of text we'll need to capture:
#+begin_example:
Topic #10:
Element #9:
OR
Element
sm18.exe/Second Language
#+end_example:

We can test if our regex captures a given buffer:

#+begin_src elisp :noweb yes
;;TODO use `cl-loop' here instead with its buffer spec
(seq-filter (lambda (buf)
              (string-match-p
               <<element-window-rx>>
               (buffer-name buf)))
            (buffer-list))
#+end_src

** Key SuperMemo windows
:PROPERTIES:
:CREATED:  [2021-09-23 Thu 13:15]
:ID:       523441d5-46f3-45e4-9900-c9ce786dd9f7
:END:
We'll start with the outlier first as its the most important window. Normally, SuperMemo will start with the first scheduled item of the day loaded into the elements window. The element name bleeds into the =WM_TITLE= variable and since we can't predict which element would be presented first on any given day, we will have to use a work around to get a stable title.

The following makes use of Supermemo's ability to set a constant element via the bla bla menu. While this was originally intended to display quotes or the like it works nicely for us as the same text will be shown via =WM_TITLE= and by extension by in the =exwm-title= variable.
Besides, Emacs can be rigged to have this kind of functionality at startup and perform it even better.

Here I use =home= as the only text in the element body, but you can use whatever you like. I've written the hooks in such a way that the buffer-name will remain constant even after progressing past this initial home element.

#+name: element-window-rx
#+begin_src elisp
(rx bol "home" eol)
#+end_src

#+RESULTS: element-window-rx
: ^home$

#+NAME: element-data-rx
#+begin_src elisp
(rx
 (|
  (seq (or "Topic" "Element") space "#" (one-or-more digit) ":")
  (seq "Element data")))
#+end_src

Next capture the knowledge tree:
"X:sm18.exe/neuron"
#+NAME: knowledge-tree-rx
#+begin_src elisp
(rx bol "neuron" eol)
#+end_src

#+RESULTS: knowledge-tree-rx
: ^neuron$

We'll also attempt to suppress the empty(?) buffer created by Supermemo.
This seems to be a frame made for SM.
#+NAME: empty-sm-frame-rx
#+begin_src elisp
(regexp-quote "z:\\home\\nanjigen\\documents\\sm")
#+end_src

#+RESULTS: empty-sm-frame-rx
: z:\\home\\vrika\\documents\\sm

Now we'll throw this together as a set of buffer rules:

** Creating the =sm18.exe= class
:PROPERTIES:
:CREATED:  [2020-11-20 Fri 10:39]
:ID:       c0a59157-a741-4824-b25e-4b8cab63a2d9
:END:

The catch-all [[file:~/.doom.d/modules/desktop/exwm/+funcs.el::defun exwm/rename-buffer (][exwm/rename-buffer]] function captures the sm buffers on each update of the =title-hook=. We need to exclude members of the =sm18.exe= class from this over-general hook:

Exclusion from the generic =exwm/rename-buffer= function based on =exwm-class=:
#+begin_src elisp :noweb yes :noweb-ref exwm-title-hook
(add-hook 'exwm-update-title-hook
          (defun my-exwm-update-title-hook ()
            (unless (or (string-prefix-p "sm18.exe" exwm-class-name))
              (exwm/rename-buffer))))

#+end_src

However, currently the [[file:~/.local/share/applications/supermemo18.supermemo18.desktop::StartupWMClass=sm18.exe][StartupWMClass]] for sm18 is not propagating out to the actuall WM_CLASS as =sm18.exe=, possibly as a limitation of =wine-5.2= (actually, the =.desktop= entry doesn't work for me at all).

The below now works by hooking into the stable =exwm-instance-name=

#+begin_src elisp :noweb yes :noweb-ref exwm-class-hook
(add-hook 'exwm-update-class-hook
          (defun rename-sm-class ()
            "Rename sm18.exe class"
            (when (string-match (rx "sm18.exe") exwm-instance-name)
              (setq exwm-class-name exwm-instance-name))))

(add-hook 'exwm-update-class-hook
          (defun my-exwm-update-class-hook ()
            (unless (or (string-prefix-p "sm18.exe" exwm-class-name))
              (exwm/rename-buffer))))

#+end_src

** Regex and buffer alists
:PROPERTIES:
:CREATED:  [2021-10-02 Sat 11:25]
:ID:       fe2492e4-5d72-481b-8c9b-2b8358055ea7
:END:
A cleaner approach than multiple ~when~ statements is to store the target =buffer-name= and =exwm-title= regex's as key . value pairs, respectively [fn:1].

I should probably be writing this as =cons= and not using backquotes.
#+begin_src elisp :noweb yes :noweb-ref sm-window hooks
(setq exwm-sm-core-buffer-alist
      (list `("sm-element-window" . ,<<element-window-rx>>)
            `("sm-knowledge-tree" . ,<<knowledge-tree-rx>>)
            '("sm-template-registry" . "Template Registry")
            `("sm-element-data" . ,
               <<element-data-rx>>)
            `("sm-frame" . ,<<empty-sm-frame-rx>>)))

#+end_src

#+begin_src elisp :noweb yes :noweb-ref sm-window hooks
(add-hook 'exwm-update-title-hook
          (defun sm-core-window-title-hook ()
            "Manage the core names"
            (cl-loop for (key . value) in exwm-sm-core-buffer-alist
                     if (string-match value exwm-title)
                     do (exwm-workspace-rename-buffer key)
                        (setq exwm-title key))))

#+end_src

#+begin_src elisp :noweb yes :noweb-ref sm-window hooks
(setq exwm-sm-floating-buffer-alist
      '(("sm-images" . "Images")
        ("sm-sorting-criteria" . "Repetition sorting criteria")
        ("sm-concepts" . "Concepts")
        ("sm-new-concept" . "New Concept")
        ("sm-subset" . "Subset")
        ("sm-repair-options" . "Repair Options")
        ("sm-statistics" . "Analysis")
        ("sm-modify-priority" . "Element Priority")
        ("sm-backup-copy" . "Copying")
        ("sm-info-window" . "Information")
        ("sm-algo-choice" . "Choices")
        ("sm-options-window" . "Options")
        ("sm-fonts-window" . "Fonts")
        ("sm-outstanding" . "Outstanding")
        ("sm-commander" . "SuperMemo Commander")
        ;; ("sm-template-registry" . "Template Registry")
        ("sm-element-finder" . "Find elements")))

#+end_src

#+begin_src elisp :noweb yes :noweb-ref sm-window hooks
(add-hook 'exwm-update-title-hook
          (defun sm-window-title-hook ()
            "Iterate over naming alist and rename `exwm-title' to key"
            (cl-loop for (key . value) in exwm-sm-floating-buffer-alist
                     if (string-match (regexp-quote value) exwm-title)
                     do (exwm-workspace-rename-buffer key)
                        (setq exwm-title key))))

#+end_src

[fn:1] I can't find a reason to avoid the small amount of hardcoding done here. The fine-grained control outweighs any convenience automating naming would bring (as it would introduce unpredicability in the buffer naming).

Here we loop over the predefined buffer names in =exwm-sm-window-names=, adding them iteratively to =exwm-manage-configurations=. The two different loops are to differentiate floating vs non-floating windows:

#+begin_src elisp :noweb yes :noweb-ref sm managed configurations
;; (setq exwm-manage-configurations nil)
;; (add-to-list 'exwm-manage-configurations '((string= exwm-instance-name "sm18-core") managed t floating nil))
(add-to-list 'exwm-manage-configurations '((string= exwm-class-name "sm18.exe") managed t floating nil))

(cl-loop for (key . value) in exwm-sm-core-buffer-alist
         do (push `((string= exwm-title ,key) managed t floating nil) exwm-manage-configurations))

(cl-loop for (key . value) in exwm-sm-floating-buffer-alist
         do (push `((string= exwm-title ,key) managed t floating t) exwm-manage-configurations))

(add-to-list 'exwm-manage-configurations '((string= exwm-class-name "notepad.exe") managed t floating nil))
#+end_src

#+begin_src elisp :noweb yes :noweb-ref window assignments :results silent
(require 'subr-x)  ;; Because of when-let

(defvar exwm-workspace-window-assignments
  '(("sm-element-window" . 3)
    ("sm-knowledge-tree" . 3)
    ("sm-element-data" . 3))
  "An alist of window classes and which workspace to put them on.")

(add-hook 'exwm-manage-finish-hook
          (lambda ()
            (when-let ((target (cdr (assoc exwm-class-name exwm-workspace-window-assignments))))
              (exwm-workspace-move-window target))))
#+end_src

#+begin_src elisp :noweb yes :tangle ~/.doom.d/modules/desktop/exwm/+sm-window-rules.el
;;; desktop/exwm/+sm-window-rules.el -*- lexical-binding: t; -*-

<<exwm-class-hook>>

<<sm-window hooks>>

<<sm managed configurations>>

<<dbc rules>>
#+end_src

** display-buffer-alist
:PROPERTIES:
:CREATED:  [2020-10-19 Mon 13:31]
:ID:       6b6b8247-b27b-4771-bd30-74ec4653f123
:header-args: :noweb-ref buffer alist hooks
:END:
Once have these tested and working, theoretically as x-windows under EXWM are just emacs buffers, they could be controlled with the built-in ~display-buffer~ tooling via ~display-buffer-alist~:

#+begin_src elisp :tangle no :noweb no
;; (add-to-list 'display-buffer-alist
;;              `((,<<empty-sm>>
;;                 (display-buffer-no-window))
;;                (,<<tree-rx>>
;;                 (display-buffer-reuse-window display-buffer-in-side-window)
;;                 (side . left)
;;                 (slot . 0)
;;                 (window-width . 0.22))
;;                (,<<element-data-rx>>
;;                 (display-buffer-at-bottom)
;;                 ;; (side . bottom)
;;                 ;; (slot . 0)
;;                 (window-height . 0.19))))
#+end_src

However, this doesn't work as expected an we have to wrap this rules in an exwm hook:
#+begin_src elisp :noweb yes :results silent
(add-hook 'exwm-manage-finish-hook
          (lambda ()
            (when (string-match-p "sm-frame" (buffer-name))
              (display-buffer
               (get-buffer-create "sm-frame")
               '((display-buffer-no-window)
                 (allow-no-window . t))))
            (when (string-match-p "sm-element-window" (buffer-name))
              (display-buffer
               (get-buffer-create "sm-element-window")
               (doom-modeline-mode 1)
               '((display-buffer-same-window))))
            (when (string-match-p "sm-knowledge-tree" (buffer-name))
              (display-buffer
               (get-buffer-create "sm-knowledge-tree")
               '((display-buffer-in-side-window)
                 ;; (inhibit-same-window . t)
                 (side . left)
                 (slot . 0)
                 (window-width . 0.21))))
            (when (string-match-p "sm-element-data" (buffer-name))
              (progn (exwm-layout-hide-mode-line)
                     (display-buffer
                      (get-buffer-create "sm-element-data")
                      '((display-buffer-in-side-window)
                        ;; (inhibit-same-window . t)
                        (side . bottom)
                        (slot . 1)
                        (window-height . 0.21)))))))
#+end_src



#+begin_src elisp :tangle no :noweb yes :results silent
;; (remove-hook 'exwm-manage-finish-hook
;;           (lambda ()
;;             (when (string-match-p
;;                    <<element-data-rx>>
;;                    (buffer-name))
;;               (display-buffer-in-side-window (current-buffer)
;;                                              '((side . bottom)
;;                                                (slot . 0)
;;                                                (window-width . 0.23))))))
#+end_src

** Final buffer tangle
:PROPERTIES:
:CREATED:  [2020-10-19 Mon 13:36]
:ID:       bef0674e-a594-442b-a959-c7005f24a4d4
:header-args: :noweb-ref dbc rules
:END:
#+begin_src elisp :noweb yes


<<exwm-title-hook>>

<<buffer alist hooks>>
;; <<element window rule>>

;; <<left rule>>

;; <<element tray rule>>

;; )
#+end_src

* sm-core
:PROPERTIES:
:CREATED:  [2020-11-20 Fri 15:55]
:ID:       b98cd336-e48d-4a92-9998-bd88a20b1d12
:END:
Here we'll define the core keypress events we'd want to send to Supermemo.

