.doom.d/modules/desktop/exwm/+exwm-sm-core.el
;;; desktop/exwm/+exwm-sm-evil.el -*- lexical-binding: t; -*-

(require 'exwm)
(require 'exwm-input)

(defun exwm-sm-xdotool-send-key (mod-key keypress)
  "Send a reload event to Firefox."
  (interactive)
  (let ((key keypress)
        ;; (window-id exwm--id)
        (modifier mod-key))
    (shell-command
     (format "xdotool keydown %s sleep 0.1" modifier))
    (exwm-input--fake-key key)
    (shell-command
     (format "xdotool keyup %s"  modifier))))

(defun exwm-input--on-ButtonPress-line-mode (buffer button-event)
  "Handle button events in line mode.
BUFFER is the `exwm-mode' buffer the event was generated
on. BUTTON-EVENT is the X event converted into an Emacs event.

The return value is used as event_mode to release the original
button event."
  (with-current-buffer buffer
    (let ((read-event (exwm-input--mimic-read-event button-event)))
      (exwm--log "%s" read-event)
      (if (and read-event
               (exwm-input--event-passthrough-p read-event))
          ;; The event should be forwarded to emacs
          (progn
            (exwm-input--cache-event read-event)
            (exwm-input--unread-event button-event)

            xcb:Allow:ReplayPointer)
        ;; The event should be replayed
        xcb:Allow:ReplayPointer))))

;;; Basic navigation
;;;###autoload
(defun exwm-sm-core-up ()
  "Move up."
  (interactive)
  (exwm-input--fake-key 'up))

;;;###autoload
(defun exwm-sm-core-down ()
  "Move down."
  (interactive)
  (exwm-input--fake-key 'down))

;;;###autoload
(defun exwm-sm-core-left ()
  "Move down."
  (interactive)
  (exwm-input--fake-key 'left))

;;;###autoload
(defun exwm-sm-core-right ()
  "Move down."
  (interactive)
  (exwm-input--fake-key 'right))

;;;###autoload
(defun exwm-sm-core-word ()
  "Word noun"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'right))

;;;###autoload
(defun exwm-sm-core-word-back ()
  "Back word"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'left))

;;;###autoload
(defun exwm-sm-core-beginning-of-line ()
  "Go to line start"
  (interactive)
  (exwm-input--fake-key 'home))

;;;###autoload
(defun exwm-sm-core-end-of-line ()
  "Go to line end"
  (interactive)
  (exwm-input--fake-key 'end))

;;;###autoload
(defun exwm-sm-core-goto-parent ()
  "Go to parent of current element"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'up))

;;;###autoload
(defun exwm-sm-core-goto-child ()
  "Go to the first child of current element"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'down))

;;;###autoload
(defun exwm-sm-core-forward ()
  "Go forward element"
  (interactive)
  (exwm-sm-xdotool-send-key "alt" 'right))

;;;###autoload
(defun exwm-sm-core-back ()
  "Go back element"
  (interactive)
  (exwm-sm-xdotool-send-key "alt" 'left))

;;;###autoload
(defun exwm-sm-core-goto-first-line ()
  "Go to top of component page"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'home))

;;;###autoload
(defun exwm-sm-core-goto-last-line ()
  "Go to bottom of component page
Note that this goes past the references"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'end))

;;;###autoload
(defun exwm-sm-core-scroll-up ()
  "Scroll up"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl+End"))

;;;###autoload
(defun exwm-sm-core-scroll-down ()
  "Scroll Down"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl+End"))

;;;###autoload
(defun exwm-sm-core-scroll-page-up ()
  "Scroll up by page length"
  (interactive)
  (exwm-sm-xdotool-send-key "Page_Up"))

;;;###autoload
(defun exwm-sm-core-scroll-line-down ()
  "Scroll one visual line down"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl+End"))

;;;###autoload
(defun exwm-sm-core-scroll-page-down ()
  "Scroll down by page length"
  (interactive)
  (exwm-sm-xdotool-send-key "Page_Down"))

;;;###autoload
(defun exwm-sm-core-scroll-line-up ()
  "Scroll one visual line up"
  (interactive)
  (exwm-sm-xdotool-send-key "Page_Down"))

;;;; Selection

;;;###autoload
(defun exwm-sm-core-visual-char ()
  "Start visual char selection."
  (interactive)
  (exwm-sm-xdotool-send-key "Shift" 'right))

;;;###autoload
(defun exwm-sm-core-visual-line ()
"Start visual line selection."
  (interactive)
  (exwm-input--fake-key 'home)
  (exwm-sm-xdotool-send-key "Shift+End")
  (evil-visual-state))

;;;###autoload
(defun exwm-sm-core-select-all ()
  "Select whole page."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl+a"))

;;; Find/Search

;;;###autoload
(defun exwm-sm-core-find ()
  "Find general."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f))

;;;###autoload
(defun exwm-sm-core-search ()
  "Search for texts containing a given string."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'r))

;;;###autoload
(defun exwm-sm-core-find-elements ()
  "Find elements."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f))

;;;###autoload
(defun exwm-sm-core-search-phrase ()
  "Search currently selected phrase."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f3))

;;;###autoload
(defun exwm-sm-core-search-element-id ()
  "Goto element with a given element-id"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'g))

;;;###autoload
(defun exwm-sm-core-find-next ()
  "Find next."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'g))

;;;###autoload
(defun exwm-sm-core-find-previous ()
  "Find previous."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl Shift" 'g))

;;; Editing

;;;###autoload
(defun exwm-sm-core-escape ()
  (interactive)
