supermemo_config.org
** Editing
:PROPERTIES:
:CREATED:  [2021-04-21 Wed 12:25]
:ID:       1d576d49-e772-40ec-a57c-2160d44fd808
:END:
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+exwm-sm-core.el
;;; Editing

;;;###autoload
(defun exwm-sm-core-escape ()
  (interactive)
  (exwm-input--fake-key 'escape))

;;;###autoload
(defun exwm-sm-core-paste ()
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'v))

(defun exwm-sm-core-paste-html ()
  "Paste html from clipboard."
   (interactive)
   (exwm-sm-xdotool-send-key "Shift" 'f10)
   (exwm-input--fake-key 'x)
   (exwm-input--fake-key 'p))

;;;###autoload
(defun exwm-sm-core-copy ()
  "Copy to clipboard."
   (interactive)
   (exwm-sm-xdotool-send-key "ctrl" 'c))

;;;###autoload
(defun exwm-sm-core-cut ()
  "Cut text."
   (interactive)
   (exwm-sm-xdotool-send-key "ctrl" 'x))

;;;###autoload
(defun exwm-sm-core-undo ()
  "Undo."
   (interactive)
   (exwm-sm-xdotool-send-key "ctrl" 'u))

;;;###autoload
(defun exwm-sm-core-redo ()
  "Redo."
   (interactive)
   (exwm-sm-xdotool-send-key "ctrl Shift" 'z))

;;;###autoload
(defun exwm-sm-core-bold ()
  "Embolden selected text"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'b))

;;;###autoload
(defun exwm-sm-core-italic ()
  "Italicise selected text."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'i))

;;;###autoload
(defun exwm-sm-decrease-font ()
  "Decrease selected font size"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" '\[))

;;;###autoload
(defun exwm-sm-increase-font ()
  "Increase selected font size"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" '\]))

;;;###autoload
(defun exwm-sm-core-edit-question ()
  "Edit the question component"
  (interactive)
  (exwm-input--fake-key 'escape)
  (exwm-input--fake-key 'q))

;;;###autoload
(defun exwm-sm-core-edit-answer ()
  "Edit the first answer"
  (interactive)
  (exwm-input--fake-key 'escape)
  (exwm-input--fake-key 'a))

;;;###autoload
(defun exwm-sm-core-edit-file ()
  "Edit .HTM file"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f9))

;;;###autoload
(defun exwm-sm-core-edit-next-component ()
  "Edit the next component in element window"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 't))

;;;###autoload
(defun exwm-sm-core-edit-switch-mode ()
  "Cycle presentation -> editing -> dragging modes"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'e))

#+end_src

** Element functions
:PROPERTIES:
:CREATED:  [2021-04-21 Wed 12:45]
:ID:       6f4b7ba2-8c14-4a7f-a03a-06dd3f193523
:END:
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+exwm-sm-core.el
;;;###autoload
(defun exwm-sm-core-elements-dismiss-element ()
"Dismiss element while in element window"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'd))

;;;###autoload
(defun exwm-sm-core-element-params ()
  "Bring up apply template menu"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'p))

;;;###autoload
(defun exwm-sm-core-insert-image ()
  "Insert image into component."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'F8))

;;;###autoload
(defun exwm-sm-core-insert-splitline ()
  "Insert splitline in the component menu"
  (interactive)
  (exwm-sm-xdotool-send-key "Shift alt" 'h))

;;;###autoload
(defun exwm-sm-core-cycle-image-stretch ()
  "Cycle stretch of image component."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'q))

;;;###autoload
(defun exwm-sm-core-apply-template ()
  "Bring up apply template menu"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl Shift" 'm))

;;;###autoload
(defun exwm-sm-core-item-picture ()
  "Apply Item Picture template to element"
  (interactive)
  (exwm-sm-core-apply-template)
  (exwm-sm-xdotool-send-string "Item Article"))

;;;###autoload
(defun exwm-sm-core-item-picture ()
  "Apply Item Picture template to element"
  (interactive)
  (exwm-sm-core-apply-template)
  (exwm-sm-xdotool-send-string "Item Picture"))

;;;###autoload
(defun exwm-sm-core-import-component ()
  "Import component in element window"
  (interactive)
  ;; TODO direct this to the `sm-element-window'
  (exwm-sm-xdotool-send-key "ctrl" 'q))

;;;###autoload
(defun exwm-sm-core-reorder-components ()
  "Bring up reorder components menu"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'o))

;;;###autoload
(defun exwm-sm-core-reference-label ()
  "Bring up references menu"
  (interactive)
  (exwm-sm-xdotool-send-key "alt" 'q))

;;;###autoload
(defun exwm-sm-core-test-rep-cycle ()
  "Emulate learning mode to test element/components"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl alt" 'l))

;;;###autoload
(defun exwm-sm-core-tile-components ()
  "Go into tiling menu for component tiling"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl alt" 't))

(defun exwm-sm-core-ancestors ()
"Bring up element ancestors menu"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl Shift" 'x))

(defun exwm-sm-core-create-hyperlink ()
"Create hyperlink over selected text"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'k))

;; (defun exwm-sm-core-get-filepath ()
;; "Get the file path of the current element"
;;   (interactive)
;;   (exwm-sm-xdotool-send-key "~/.scripts/ahk/get-filepath.exe"))
#+end_src

translate winpath
#+begin_src elisp :tangle no
(let ((unix-path (replace-regexp-in-string "\n\\'" ""
                  (shell-command-to-string
                   (shell-quote-argument "winepath -u $(xclip -sel clip -o)"))))))
(shell-command "xclip -sel clip -o")

(subst-char-in-string ?\\ ?\ (gui--selection-value-internal 'CLIPBOARD))
#+end_src


