supermemo_config.org
** Learn operations
:PROPERTIES:
:CREATED:  [2021-04-21 Wed 12:46]
:ID:       88b59ad6-d7ea-4e85-b828-c147fa4bb902
:END:
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+exwm-sm-core.el
;;; Learn operations

;;;###autoload
(defun exwm-sm-core-learn ()
  "Start learning."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'l))

;;;###autoload
(defun exwm-sm-core-execute-rep ()
  "Execute repition."
  (interactive)
  (exwm-input--fake-key 'enter))

;;;###autoload
(defun exwm-sm-core-replay ()
  "Replay component."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'F10))

;;;###autoload
(defun exwm-sm-core-cloze ()
  "Extract selected text."
  (interactive)
  (exwm-sm-xdotool-send-key "alt" 'z))

;;;###autoload
(defun exwm-sm-core-extract ()
  "Extract selected text."
  (interactive)
  (exwm-sm-xdotool-send-key "alt" 'x))

;;;###autoload
(defun exwm-sm-core-schedule-extract ()
  "Extract and schedule for a later time."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl alt" 'x))

;;;###autoload
(defun exwm-sm-core-prioritize ()
  "Modify priority of current element."
  (interactive)
  ;;TODO perhaps enter char-mode or create hydra on window
  (exwm-sm-xdotool-send-key "alt" 'p))

;;;###autoload
(defun exwm-sm-core-reschedule ()
  "Learning: Reschedule to another day."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'j))

;;;###autoload
(defun exwm-sm-core-postpone ()
  "Schedule review later today."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl Shift" 'j))

;;;###autoload
(defun exwm-sm-core-remember ()
  "Introduce element into learning que."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'm))

;;;###autoload
(defun exwm-sm-core-execute-rep ()
  "Execute a mid-interval rep at later date."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl Shift" 'r))

;;;###autoload
(defun exwm-sm-core-cancel-grade ()
  "Undo grading on element."
  (interactive)
  (exwm-sm-xdotool-send-key "alt" 'g))

;;;###autoload
(defun exwm-sm-core-branch-learning ()
  "Subset review of a selection of a branch in contents."
  (interactive)
;;; TODO somekind of buffer check
  (exwm-sm-xdotool-send-key "ctrl" 'l))

;;;###autoload
(defun exwm-sm-core-random-learning ()
  "Random learning."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f11))

;;;###autoload
(defun exwm-sm-core-random-test ()
  "Random test."
  (interactive)
  ;; TODO target browser window
  (exwm-sm-xdotool-send-key "ctrl" 'f11))

;;;###autoload
(defun exwm-sm-core-set-read-point ()
  "Set the read-point."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f7))

;;;###autoload
(defun exwm-sm-core-mercy ()
  "Activate mercy."
  (interactive)
  (exwm-sm-xdotool-send-key "Shift alt" 'm))

;;;###autoload
(defun exwm-sm-core-neural ()
  "Go neural."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'F2))

;;;###autoload
(defun exwm-sm-core-sorting-criteria ()
  "Open sorting criteria window."
  (interactive)
  (exwm-sm-xdotool-send-key "alt" 'l)
  (exwm-input--fake-key 'o)
  (exwm-input--fake-key 'c))

;;;###autoload
(defun exwm-sm-core-subset-learning ()
  "Subset learning."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'l))

#+end_src

** Knowledge tree operations
:PROPERTIES:
:CREATED:  [2021-04-21 Wed 15:27]
:ID:       a34b8b01-dc40-4ee0-be9c-fdc44715ba48
:END:
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+exwm-sm-core.el
;;;###autoload
(defun exwm-sm-convert-to-concept ()
  "Convert element to concept"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl+k"))

;;;###autoload
(defun exwm-sm-new-article ()
  "Create new article"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl+n"))

#+end_src

** Misc operations
:PROPERTIES:
:CREATED:  [2021-04-21 Wed 13:48]
:ID:       795a6453-5dfc-42e4-b2cf-735fdd224d0c
:END:
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+exwm-sm-core.el
;;; Misc

;;;###autoload
(defun exwm-sm-core-sm-commander ()
  "Summon the SuperMemo Commander"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'return))

;;;###autoload
(defun exwm-sm-core-repair-collection ()
  "Bring up the collection repair menu"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f12))

;;;###autoload
(defun exwm-sm-core-restore-layout ()
  "Restore the default window layout"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f5))

;;;###autoload
(defun exwm-sm-core-statistics-analysis ()
  "Open stats window"
  (interactive)
  (exwm-sm-xdotool-send-key "Shift+alt+a"))

;;;###autoload
(defun exwm-sm-core-open-file ()
  "Open file."
  (interactive)
  (exwm-input--fake-key ?\C-o))

;;;###autoload
(defun exwm-sm-core-quit ()
  "Quit sm."
  (interactive)
  (exwm-input--fake-key ?\C-q))

(provide '+exwm-sm-core)
#+end_src


** TODO Try get ~input-fake-key~ working with Wine
:PROPERTIES:
:CREATED:  [2020-12-08 Tue 15:05]
:ID:       733fbf64-129d-4b63-8b92-8fcc569c5627
:END:
Testing some elisp functions to convert Windows paths from Wine to Linux
#+begin_src elisp :tangle no
(defun my-translate-winpath ()
  "change :C\win\path to 'nix /path/path"
  (let ((path (current-kill 0 'do-not-move)))
    (shell-command-to-string (format "~/.scripts/winpath.sh %s" path))))

(defun my-translate-winpath ()
  "change :C\win\path to 'nix /path/path"
  (let ((path (current-kill 0 'do-not-move)))
    (my-translate-path)))

(defun my-translate-winpath ()
  (interactive)
  (let* ((path (s-chop-prefix "z:" (current-kill 0 'do-not-move)))
         (nixpath (s-replace "\\" "/" path))
         (path1 (s-replace "documents" "Documents" nixpath)))
    (s-replace "sm" "SM" path1)))
#+end_src

Let's test this with Xdotool. It works, but isn't reliable.
#+begin_src elisp :tangle no
(defun exwm-sm-core-test ()
  "Send string to a given exwm buffer"
  (interactive)
(progn)
(my-translate-winpath)
;; (sit-for 3)
(message sm-path-nix))

(defun exwm-sm-core-test ()
  "Send string to a given exwm buffer"
  (interactive)
  ;; (shell-command "sh ~/.scripts/xdotool/get_element_path.sh"))
  (shell-command "sh ~/.scripts/xdotool/get_element_path.sh"))

(defun exwm-sm-core-test ()
  "Send string to a given exwm buffer"
  (interactive)
(progn
  (shell-command "sh ~/.scripts/xdotool/get_element_path.sh")
  (gui--selection-value-internal 'CLIPBOARD)))

(defun exwm-sm-core-test ()
  "Send string to a given exwm buffer"
  (interactive)
  (shell-command "sh ~/.scripts/xdotool/get_element_path.sh")
(lambda ()
)
  (setq sm-path (gui--selection-value-internal 'CLIPBOARD)))
  ;; (shell-command "sh ~/.scripts/xdotool/get_element_path.sh"))
#+end_src

Testing with EXWM functionality (elisp only).
The big issue here is that control keys are not passed on to the Wine application. However, they are when using ~exwm-input-send-next-key~.
#+begin_src elisp :tangle no
(defun exwm-sm-core-test()
  "test"
  (interactive)
  ;; (exwm--log)
  ;; (let ((exwm-input-line-mode-passthrough t))
         ;; (key "?/C-v"))
         ;; (key (read-key "22")))
    (exwm-input--fake-key ("?/C-s-o")))

(exwm-input-set-key (kbd "<f9>") #'exwm-sm-core-test)


;;;###autoload
(defun exwm-sm-core-test ()
  "Move down."
  (interactive)
  (let ((exwm-input-line-mode-passthrough t))
    (exwm-input--fake-key 'left)))
#+end_src

#+RESULTS:

Try and get the right key code
#+begin_src elisp :tangle no
;; (read-key)
(vector "v")
#+end_src

#+RESULTS:
: ["? C-v"]

Trying the same but with a string.
#+begin_src elisp :tangle no
(defun my-exwm-send-string (string)
  "Send STRING to `exwm-mode' buffer or just insert it."
  (if (eq major-mode 'exwm-mode)
      (mapc #'exwm-input--fake-key (string-to-list string))
    (insert string)))

(defun exwm-sm-core-string-test ()
  (interactive)
  ;; (let ((exwm-input-line-mode-passthrough t))
    ;; (my-exwm-send-string [#o26])))
  (my-exwm-send-string [94 3]))

;; (term-send-raw-string "l")

;; (read-key-sequence-vector)

(exwm-input-set-key (kbd "<f9>") #'exwm-sm-core-string-test)
;; ###autoload
;; (defun exwm-sm-core-test ()
;;   "Send string to a given exwm buffer"
;;   (interactive)
;;   (my-exwm-send-string "sm-get-path ")
;;   (find-file (my-translate-winpath)))
#+end_src

Try with this
#+begin_src elisp :tangle no
(cl-defun exwm-input-send-sim-key (key)
  "Fake a key event according to the last input key sequence."
  (interactive)
  (exwm--log)
  (unless (derived-mode-p 'exwm-mode)
    (cl-return-from exwm-input-send-simulation-key))
  (let ((keys (gethash (this-single-command-keys)
                       exwm-input--simulation-keys)))
    (dolist (key keys)
      (exwm-input--fake-key key))))
#+end_src

#+begin_src elisp :tangle no
(cl-defun my-exwm-input-send-next-key (keys)
  "Send next key to client window.

EXWM will prompt for the key to send.  This command can be prefixed to send
multiple keys.  If END-KEY is non-nil, stop sending keys if it's pressed."
  (interactive "p")
  (exwm--log)
  (unless (derived-mode-p 'exwm-mode)
    (cl-return-from my-exwm-input-send-next-key))
  (let (key keys)
      ;; Skip events not from keyboard
      (let ((exwm-input-line-mode-passthrough t))
            ;; (setq key (read-key (format (key-description keys))
        (setq key (key-description "?\C-v")))
      (setq keys (vconcat keys (vector key)))
      (exwm-input--fake-key key)))
#+end_src

#+begin_src elisp :tangle no
(defun exwm-sm-core-test()
  "test"
  (interactive)
  (exwm/enter-char-mode)
  (exwm-input--fake-key ?\C-v))

  ;; (exwm-input-release-keyboard)
(defun exwm-sm-core-test ()
  "Copy text."
  (interactive)
  (exwm-input--invoke--m))
(exwm-input-invoke-factory "m")

;;;###autoload
(defun exwm-sm-core-copy ()
  "Copy text."
  (interactive)
  (exwm-input--fake-key ?\C-c))

#+end_src

