.doom.d/modules/desktop/exwm/+exwm-sm-core.el
  "Execute repition."
  (interactive)
  (exwm-input--fake-key 'enter))

;;;###autoload
(defun exwm-sm-core-replay ()
  "Replay component."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'F10))

;;;###autoload
(defun exwm-sm-core-cloze ()
  "Extract selected text."
  (interactive)
  (exwm-sm-xdotool-send-key "alt" 'z))

;;;###autoload
(defun exwm-sm-core-extract ()
  "Extract selected text."
  (interactive)
  (exwm-sm-xdotool-send-key "alt" 'x))

;;;###autoload
(defun exwm-sm-core-schedule-extract ()
  "Extract and schedule for a later time."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl alt" 'x))

;;;###autoload
(defun exwm-sm-core-prioritize ()
  "Modify priority of current element."
  (interactive)
  ;;TODO perhaps enter char-mode or create hydra on window
  (exwm-sm-xdotool-send-key "alt" 'p))

;;;###autoload
(defun exwm-sm-core-reschedule ()
  "Learning: Reschedule to another day."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'j))

;;;###autoload
(defun exwm-sm-core-postpone ()
  "Schedule review later today."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl Shift" 'j))

;;;###autoload
(defun exwm-sm-core-remember ()
  "Introduce element into learning que."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'm))

;;;###autoload
(defun exwm-sm-core-execute-rep ()
  "Execute a mid-interval rep at later date."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl Shift" 'r))

;;;###autoload
(defun exwm-sm-core-cancel-grade ()
  "Undo grading on element."
  (interactive)
  (exwm-sm-xdotool-send-key "alt" 'g))

;;;###autoload
(defun exwm-sm-core-branch-learning ()
  "Subset review of a selection of a branch in contents."
  (interactive)
;;; TODO somekind of buffer check
  (exwm-sm-xdotool-send-key "ctrl" 'l))

;;;###autoload
(defun exwm-sm-core-random-learning ()
  "Random learning."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f11))

;;;###autoload
(defun exwm-sm-core-random-test ()
  "Random test."
  (interactive)
  ;; TODO target browser window
  (exwm-sm-xdotool-send-key "ctrl" 'f11))

;;;###autoload
(defun exwm-sm-core-set-read-point ()
  "Set the read-point."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f7))

;;;###autoload
(defun exwm-sm-core-mercy ()
  "Activate mercy."
  (interactive)
  (exwm-sm-xdotool-send-key "Shift alt" 'm))

;;;###autoload
(defun exwm-sm-core-neural ()
  "Go neural."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'F2))

;;;###autoload
(defun exwm-sm-core-sorting-criteria ()
  "Open sorting criteria window."
  (interactive)
  (exwm-sm-xdotool-send-key "alt" 'l)
  (exwm-input--fake-key 'o)
  (exwm-input--fake-key 'c))

;;;###autoload
(defun exwm-sm-core-subset-learning ()
  "Subset learning."
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'l))

;;;###autoload
(defun exwm-sm-convert-to-concept ()
  "Convert element to concept"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl+k"))

;;;###autoload
(defun exwm-sm-new-article ()
  "Create new article"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl+n"))

;;; Misc

;;;###autoload
(defun exwm-sm-core-sm-commander ()
  "Summon the SuperMemo Commander"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'return))

;;;###autoload
(defun exwm-sm-core-repair-collection ()
  "Bring up the collection repair menu"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f12))

;;;###autoload
(defun exwm-sm-core-restore-layout ()
  "Restore the default window layout"
  (interactive)
  (exwm-sm-xdotool-send-key "ctrl" 'f5))

;;;###autoload
(defun exwm-sm-core-statistics-analysis ()
  "Open stats window"
  (interactive)
  (exwm-sm-xdotool-send-key "Shift+alt+a"))

;;;###autoload
(defun exwm-sm-core-open-file ()
  "Open file."
  (interactive)
  (exwm-input--fake-key ?\C-o))

;;;###autoload
(defun exwm-sm-core-quit ()
  "Quit sm."
  (interactive)
  (exwm-input--fake-key ?\C-q))

(provide '+exwm-sm-core)
