supermemo_config.org
** Visual maps
:PROPERTIES:
:CREATED:  [2021-10-02 Sat 11:25]
:ID:       f291281f-7415-4251-9ee2-263263661236
:END:
#+begin_src elisp :noweb yes :tangle ~/.doom.d/modules/desktop/exwm/+exwm-sm-evil.el
;; Selection
(evil-define-key 'normal exwm-sm-evil-mode-map (kbd "V") '(lambda
                                                             ()
                                                             (interactive)
                                                             (exwm-input--fake-key 'end)
                                                             (exwm-sm-evil-visual)
                                                             (exwm-input--fake-key 'up)))
(evil-define-key 'normal exwm-sm-evil-mode-map (kbd "v") '(lambda
                                                             ()
                                                             (interactive)
                                                             (exwm-sm-evil-visual)
                                                             (exwm-input--fake-key 'right)))

#+end_src


#+begin_src elisp :noweb yes :tangle ~/.doom.d/modules/desktop/exwm/+exwm-sm-evil.el
;;;; Visual
;; Basic movements
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "k") 'exwm-sm-core-up)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "j") 'exwm-sm-core-down)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "h") 'exwm-sm-core-left)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "l") 'exwm-sm-core-right)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "K") 'exwm-sm-core-goto-parent)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "J") 'exwm-sm-core-goto-child)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "H") 'exwm-sm-core-back)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "L") 'exwm-sm-core-forward)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "w") 'exwm-sm-core-word)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "b") 'exwm-sm-core-word-back)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "{") 'exwm-sm-core-visual-backward-paragraph)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "}") 'exwm-sm-core-visual-forward-paragraph)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "b") 'exwm-sm-core-word-back)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "/") 'exwm-sm-core-find)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "t") 'exwm-sm-core-test)
;; (evil-define-key 'normal exwm-sm-evil-mode-map (kbd "<escape>") 'exwm-sm-core-escape)
(evil-define-key 'visual exwm-firefox-evil-mode-map (kbd "<return>") '(lambda () (interactive) (exwm-input--fake-key 'return)))
(evil-define-key 'visual exwm-firefox-evil-mode-map (kbd "RET") '(lambda () (interactive) (exwm-input--fake-key 'return)))

;;; Motion State
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "gg") 'exwm-sm-core-goto-first-line)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "G") 'exwm-sm-core-goto-last-line)

(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "gq") 'exwm-sm-core-edit-question)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "ga") 'exwm-sm-core-edit-answer)

(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "C-u") 'exwm-sm-core-scroll-up)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "C-d") 'exwm-sm-core-scroll-up)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "C-b") 'exwm-sm-core-scroll-page-up)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "C-e") 'exwm-sm-core-scroll-line-down)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "C-f") 'exwm-sm-core-scroll-page-down)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "C-y") 'exwm-sm-core-scroll-line-up)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "RET") 'exwm-sm-core-execute-rep)
#+end_src

#+begin_src elisp :noweb yes :tangle ~/.doom.d/modules/desktop/exwm/+exwm-sm-evil.el
;; Selection
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "y") 'exwm-sm-core-copy)
#+end_src

#+begin_src elisp :noweb yes :tangle ~/.doom.d/modules/desktop/exwm/+exwm-sm-evil.el
;;; Editing text
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "y") 'exwm-sm-core-copy)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "d") 'exwm-sm-core-cut)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "p") 'exwm-sm-core-paste)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "u") 'exwm-sm-core-undo)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "C-r") 'exwm-sm-core-redo)

#+end_src

#+begin_src elisp :noweb yes :tangle ~/.doom.d/modules/desktop/exwm/+exwm-sm-evil.el
;;; Learn operations
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "x") 'exwm-sm-core-extract)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "X") 'exwm-sm-core-schedule-extract)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "SPC") 'exwm-sm-core-learn)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd ",") 'nanjigen/sm-hydra/body)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "P") 'exwm-sm-core-prioritize)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "s") 'exwm-sm-core-reschedule)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "o") 'exwm-sm-core-get-filepath)
(evil-define-key 'visual exwm-sm-evil-mode-map (kbd "r") 'exwm-sm-core-replay)

(map! :map exwm-sm-evil-mode-map
      :n "SPC" #'exwm-sm-core-learn)

#+end_src
** End
:PROPERTIES:
:CREATED:  [2021-10-02 Sat 11:25]
:ID:       ca5c53de-2eb7-4445-9b25-6641ac7f6733
:END:
#+begin_src elisp :noweb yes :tangle ~/.doom.d/modules/desktop/exwm/+exwm-sm-evil.el
;;; Mode
;;;###autoload
(define-minor-mode exwm-sm-evil-mode nil nil nil exwm-sm-evil-mode-map
  (if exwm-sm-evil-mode
      (progn
        (exwm-sm-evil-normal))))

;;;###autoload
(defun exwm-sm-evil-activate-if-sm ()
  "Activates exwm-sm mode when buffer is SM.
SM variant can be assigned in 'exwm-sm-evil-sm-name`"
  (interactive)
  (if (member exwm-class-name exwm-sm-evil-sm-class-name)
      (exwm-sm-evil-mode 1)))

(provide '+exwm-sm-evil)

;;; +exwm-sm-evil.el ends here
#+end_src

#+RESULTS:
: +exwm-sm-evil
* sm-hydra
:PROPERTIES:
:CREATED:  [2021-04-20 Tue 15:49]
:ID:       70ea4d74-e725-4448-b1fe-10c10eaa5a9a
:END:

By using a =hydra-title= like [[file:~/.emacs.d/.local/straight/repos/org-media-note/org-media-note.el::defun org-media-note--hydra-title (][here]], I can have commands run in the background to influence the names of hydra commands.
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+sm-hydra.el
;;; desktop/exwm/+sm-hydra.el -*- lexical-binding: t; -*-
(pretty-hydra-define nanjigen/sm-hydra
  (:color red
   ;; :title (--hydra-title)
   :hint nil)
  ("Learn"
   (("rr" (exwm-sm-core-remember) "Remember")
    ("c" (exwm-sm-core-cancel-grade) "Undo grading")
    ("s" (nanjigen/sm-subset-hydra/body) "Subset operations")
    ("rs" (exwm-sm-core-set-read-point) "Set read point")
    ("m" (exwm-sm-core-mercy) "Mercy")
    ("S" (exwm-sm-core-sorting-criteria) "Sorting Criteria"))
  "Editing"
   (("i" (exwm-sm-core-italic) "italics")
    ("b" (exwm-sm-core-bold) "bold")
    ("q" (exwm-sm-core-edit-question) "Edit Question")
    ("a" (exwm-sm-core-edit-answer) "Edit Answer")
    ("n" (exwm-sm-core-edit-answer) "Edit Next Component")
    ("f" (exwm-sm-core-edit-file) "Edit File"))
  "Misc"
   (("SPC" (exwm-sm-core-sm-commander) "SuperMemo Commander")
    ("rc" (exwm-sm-core-repair-collection) "Repair Collection")
    ("rl" (exwm-sm-core-restore-layout) "Restore layout")
    ("A" (exwm-sm-core-statistics-analysis) "Stats window"))))

#+end_src

#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+sm-hydra.el
;;; desktop/exwm/+sm-hydra.el -*- lexical-binding: t; -*-
(pretty-hydra-define nanjigen/sm-subset-hydra
  (:color red
   ;; :title (--hydra-title)
   :hint nil)
  ("Learn"
   (("b" (exwm-sm-core-branch-learning) "Branch learning")
    ("r" (exwm-sm-core-random-learning) "Random learning")
    ("t" (exwm-sm-core-random-test) "Random test")
    ("n" (exwm-sm-core-neural) "Go neural")
    ("s" (exwm-sm-core-subset-learning) "Subset learning"))))

#+end_src

* sm desktop
:PROPERTIES:
:CREATED:  [2020-10-19 Mon 13:36]
:ID:       c5515f7e-a0c6-40d8-8b60-36b4334874ad
:END:
.desktop file:
#+begin_src conf
[Desktop Entry]
Name=SuperMemo 18 (ms-office)
Exec=env WINEPREFIX="/home/volk/.local/share/wineprefixes/ms-office" wine "/home/volk/.local/share/wineprefixes/ms-office/drive_c/SuperMemo/sm18.exe"
Type=Application
Categories=Education;
StartupNotify=true
Comment=Organize your knowledge and learn at the maximum possible speed
Path=/home/volk/.local/share/wineprefixes/ms-office/drive_c/SuperMemo
Icon=/home/volk/.local/share/wineprefixes/ms-office/drive_c/SuperMemo/smicon.png
StartupWMClass=sm18.exe
#+end_src

* SM with Emacs
:PROPERTIES:
:CREATED:  [2021-01-04 Mon 15:52]
:ID:       a04ab1f5-a77b-4dec-8c59-3276246dfb88
:END:
