supermemo_config.org
** fs monitoring
:PROPERTIES:
:CREATED:  [2021-09-19 Sun 17:46]
:ID:       503009e6-6543-471d-b7a7-0bcfdf90aa94
:END:

Using =inotifywait= from the ~inotif-tools~ program we can watch the =$SM-COLLECTION/elements= folder recursively for file open events made by SuperMemo:
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+sm-sentinel.el
;;; desktop/exwm/+sm-sentinel.el -*- lexical-binding: t; -*-

(defun sm-element-inotify-process ()
  "Watch for reads of element files in the collection dir"
  (interactive)
  (start-process
   "inotifywait"
   "*inotifywait*"
   "inotifywait" "-mrq" "-e" "open" "/home/nanjigen/Documents/SM/neuron/elements" "--include" ".HTM"))

#+end_src

And to watch image access:
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+sm-sentinel.el
(defun sm-image-inotify-process ()
  "Watch for reads of image files in the collection dir"
  (interactive)
  (start-process
   "inotifywait-image"
   "*inotifywait-image*"
   "inotifywait" "-mrq" "-e" "open" "/home/nanjigen/Documents/SM/neuron/elements" "--include" "\.(jpg|gif|png|svg)"))
#+end_src

#+RESULTS:
: #<process inotifywait>

Setup a sentinel to watch for changes to the process buffer =*inotifywait*=
This is mostly for testing purposes
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+sm-sentinel.el
(defun msg-me (process event)
  (princ
   (format "Process: %s had the event '%s'" process event)))
(set-process-sentinel (get-process "inotifywait") 'msg-me)

#+end_src

The function below captures all the paths outputted from the ~inotifywait~ process as seperate symbols in a single list. This is then transferred to a holding variable of the same make-up, and the original list is emptied. This way, on every file read when an element is accessed by SuperMemo, only those file paths are kept in the variable, instead of appending each new file found to the list.
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+sm-sentinel.el
(defun keep-output (process output)
  "Store the paths of elements caught by inotify"
  (progn
    (setq captured-path (cons output captured-path))
    (sleep-for 0.1)
    (list-sm-element-paths)
    (setq captured-path nil)))

(defun keep-image-path (process output)
  "Store the paths of elements caught by inotify"
  (progn
    (setq captured-image-path (cons output captured-image-path))
    (sleep-for 0.1)
    (setq image-file-list (s-lines (s-replace " OPEN " "" (car captured-image-path))))
    (setq captured-image-path nil)))

#+end_src

#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+sm-sentinel.el
(defvar captured-image-path nil
  "The path captured by the inotify sentinel")

(defvar captured-path nil
  "The path captured by the inotify sentinel")

#+end_src

The below is some logic for determining if what was captured is a Topic or an element pair such as Q/A or a cloze. It then stores the path values as such.

#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+sm-sentinel.el
(defun list-sm-element-paths ()
  "Text munge captured paths"
  (setq sm-file-list (s-lines (s-replace " OPEN " "" (car captured-path))))
  (interactive)
  (if (> (length sm-file-list) 1)
      (progn
        (setq sm-element-item-p t)
        (setq sm-element-article-p nil))
    (progn
      (setq sm-element-item-p nil)
      (setq sm-element-article-p t))))

#+end_src

#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+sm-sentinel.el
(defvar sm-element-item-p nil
  "Whether currently viewed element is an item.")

(defvar sm-element-article-p nil
  "Whether currently viewed element is an article")

#+end_src

Get process and set sentinels:
#+begin_src elisp

(set-process-filter (get-process "inotifywait") 'keep-output)
(set-process-filter (get-process "inotifywait-image") 'keep-image-path)

#+end_src

#+begin_src elisp
(process-sentinel (get-process "inotifywait"))
#+end_src

Edit files:
#+begin_src elisp
(defun edit-component-as-org ()
  (interactive)
  (if sm-element-item-p t
    (let ((question (nth 0 file-list))
          (answer (nth 1 file-list)))
      (find-file question))))

#+end_src

Then we can parse these file read through to various =setq's= to be read in the background.
** sm launcher
:PROPERTIES:
:CREATED:  [2021-09-20 Mon 07:42]
:ID:       eec68fe9-9dc3-4591-9047-af0e4ea196b4
:END:

The wineprefix and drive_c should be named ~$PATHS~
#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+sm-emacs-protocol.el
(defun nanjigen/launch-sm-process ()
  "Launch SM as a process with 'start-process-shell-command'"
  (interactive)
  (start-process-shell-command
   "SuperMemo18"
   "*Supermemo18*"
   (combine-and-quote-strings '("env WINEPREFIX="
                                "/home/nanjigen/.local/share/wineprefixes/supermemo18"
                                " wine "
                                "/home/nanjigen/.local/share/wineprefixes/supermemo18/drive_c/SuperMemo/sm18.exe"
                                "") "\"")))

#+end_src

#+RESULTS:
: nanjigen/launch-sm-process

#+begin_src elisp :tangle ~/.doom.d/modules/desktop/exwm/+sm-emacs-protocol.el
(defun nanjigen/launch-notepad-process ()
  "Launch SM as a process with 'start-process-shell-command'"
  (interactive)
  (start-process-shell-command
   "Notepad"
   "*notepad.exe*"
   (combine-and-quote-strings '("env WINEPREFIX="
                                "/home/nanjigen/.local/share/wineprefixes/supermemo18"
                                " wine "
                                "notepad.exe"
                                "") "\"")))

#+end_src

#+RESULTS:
: nanjigen/launch-notepad-process

#+begin_src elisp
(process-list)
#+end_src

#+RESULTS:
| SuperMemo18 | *Guix Internal REPL* | Guile REPL | vterm | *bash-completion* | XELB | epdfinfo | server |

#+begin_src elisp
;; (process-command (get-process "SuperMemo18"))
;; (alist-get 'comm (process-attributes
;;                   (process-id (get-process "SuperMemo18"))))
;; (process-id (get-process "SuperMemo18"))
;; (get-process "SuperMemo18")
;; (process-name (get-process "SuperMemo18"))
;; (let* ((child-procs (alist-get 'comm (process-attributes 3335)))
;;        ()))
(process-attributes (process-id (get-process "SuperMemo18")))

;; (exwm--update-class 3335)
;; (exwm--id->buffer 8178896)
#+end_src

#+RESULTS:
: ((args . /home/nanjigen/.local/share/wineprefixes/supermemo18/drive_c/SuperMemo/sm18.exe) (pmem . 0.9888432805055687) (pcpu . 0.5553476355470778) (etime 0 828 310000 0) (rss . 97864) (vsize . 2725560) (start 24910 33423 939463 133000) (thcount . 4) (nice . 0) (pri . 20) (ctime 0 0 0 0) (cstime 0 0 0 0) (cutime 0 0 0 0) (time 0 4 600000 0) (stime 0 1 450000 0) (utime 0 3 150000 0) (cmajflt . 0) (cminflt . 228) (majflt . 16202) (minflt . 68015) (tpgid . 3806) (ttname . /dev/pts0) (sess . 3806) (pgrp . 3806) (ppid . 22545) (state . S) (comm . sm18.exe) (group . users) (egid . 998) (user . nanjigen) (euid . 1000))

#+begin_src sh
guix install dotnet@3
#+end_src

#+RESULTS:

#+begin_src sh
# xprop -id 3806
# pgrep sm18.exe
# xdotool search --pid 3806
# xdotool search --pid 3335 -- set_window --class sm18
xdotool search --name home

#+end_src
#+RESULTS:

81788961
** sm yasnippet
:PROPERTIES:
:CREATED:  [2021-01-04 Mon 15:52]
:ID:       9fd2197d-3730-458d-ad94-c90d7309d355
:END:

#+begin_src yasnippet
# -*- mode: snippet -*-
# name: org-pdftools-sm-reference
# key: pdf-ref
# --

#SuperMemoReference
#Title:
#Author:
#Date: Imported on Dec 28, 2020, 00:00:00
#Source: (org-ref) bibtex?
#Link: pdf:
#Comment:
#Article: 40:
#Concept group: Root: neruon (1: neuron)
#+end_src

* org-protocol
:PROPERTIES:
:CREATED:  [2021-02-19 Fri 13:42]
:ID:       4dd04a25-b81d-4da3-b6d0-dc1ba9dd307b
:END:
By using ~org-protocol~, we can call =emacsclient= from other applications by specifying a link recognised by the OS (whether is be Linux or Windows).

First we declare a regedit for WINE, in which we allow Windows to recognise the ~org-protocol:~ scheme handler:
https://github.com/nobiot/Zero-to-Emacs-and-Org-roam/blob/main/90.org-protocol.md
#+begin_src conf
Windows Registry Editor Version 5.00

[HKEY_CLASSES_ROOT\org-protocol]
@="URL:Org Protocol"
"URL Protocol"=""
[HKEY_CLASSES_ROOT\org-protocol\shell]
[HKEY_CLASSES_ROOT\org-protocol\shell\open]
[HKEY_CLASSES_ROOT\org-protocol\shell\open\command]
@="C:\\windows\\system32\\winebrowser.exe -nohome \"%1\""
#+end_src

#+begin_src sh
wine regedit
#+end_src

#+begin_src conf :tangle ~/.local/share/applications/org-protocol.desktop
[Desktop Entry]
Name=org-protocol
Exec=emacsclient -n %u
Type=Application
Terminal=false
Categories=System;
MimeType=x-scheme-handler/org-protocol;
#+end_src

#+begin_src elisp :noweb yes :tangle ~/.doom.d/modules/lang/org-private/+org-protocol.el
;;; lang/org-private/+org-protocol.el -*- lexical-binding: t; -*-

(use-package! org-protocol
  :after org
  :config
  <<org-protocol handlers>>
  )

<<org-export backend>>

#+end_src

The whole protocol system can be fairly complex in terms of flow. Let's draw a diagram to better explain our intention:



