.doom.d/modules/lang/org-private/+org-protocol.el
;;; lang/org-private/+org-protocol.el -*- lexical-binding: t; -*-

(use-package! org-protocol
  :after org
  :config
