supermemo_config.org
** Custom org-protocol handlers
:PROPERTIES:
:CREATED:  [2021-03-01 Mon 15:07]
:ID:       c342cd1d-25eb-499f-9bf5-d1b4dbf1e470
:header-args: :noweb-ref org-protocol handlers
:END:
Then we can write a custom org-id [[https://emacs.stackexchange.com/questions/47986/jump-to-org-mode-heading-from-external-application][protocol handler]]:
#+begin_src elisp

(add-to-list 'org-protocol-protocol-alist
             '("org-id" :protocol "org-id"
               :function org-id-protocol-goto-org-id))

(defun org-id-protocol-goto-org-id (info)
  "This handler simply goes to the org heading with given id using emacsclient.

    INFO is an alist containing additional information passed by the protocol URL.
    It should contain the id key, pointing to the path of the org id.

      Example protocol string:
      org-protocol://org-id?id=309A0509-81BE-4D51-87F4-D3F61B79EBA4"
  (when-let ((id (plist-get info :id)))
    (org-id-goto id))
  nil)

(defun org-id-protocol-link-copy ()
  (interactive)
  (org-kill-new (concat "org-protocol://org-id?id="
                        (org-id-copy))))

#+end_src

#+begin_src elisp
(add-to-list 'org-protocol-protocol-alist
             '("brain-id" :protocol "brain-id"
               :function brain-id-protocol-visualize-brain-id))

(defun brain-id-protocol-visualize-brain-id (info)
  "This handler visualizes the org heading with given id using emacsclient.

    INFO is an alist containing additional information passed by the protocol URL.
    It should contain the id key, pointing to the path of the org id.

      Example protocol string:
      org-protocol://brain-id?id=309A0509-81BE-4D51-87F4-D3F61B79EBA4"
  (when-let ((id (plist-get info :id)))
    (org-brain-visualize (or (org-brain-entry-from-id id))))
  nil)

(defun brain-id-protocol-link-copy ()
  (interactive)
  (org-kill-new (concat "org-protocol://brain-id?id="
                        (org-id-copy))))

#+end_src

#+begin_src elisp
(add-to-list 'org-protocol-protocol-alist
             '("pdf-tools" :protocol "pdf-tools"
               :function pdftools-protocol-pop-pdf))

(defun pdftools-protocol-pop-pdf (info)
  "This opens the highlight location of the given extract

    INFO is an alist containing additional information passed by the protocol URL.
    It should contain the org-pdf-tools link, pointing to the path of the org id.

      Example protocol string:
      org-protocol://brain-id?id=309A0509-81BE-4D51-87F4-D3F61B79EBA4"
  (when-let ((link (plist-get info :pdf)))
    (org-link-open-from-string (format "[[pdf:%s]]" link)))
  nil)

(defun pdf-tools-protocol-link-copy ()
  (interactive)
  (org-kill-new (concat "org-protocol://pdf-tools?pdf="
                        (org-entry-get nil "NOTER_PAGE"))))

(defun pdft-tools-protocol-htmlfier ()
  (interactive)
  (let ((pdf-link (org-entry-get nil "ID")))
    (format "<a href=\"org-protocol://pdf-tools?pdf=%s\"></a>" pdf-link)))

(defun pdf-tools-protocol-html-link-copy ()
  (interactive)
  (org-kill-new (concat "<a href=\"org-protocol://pdf-tools?pdf="
                        (org-entry-get nil "NOTER_PAGE") "</a>")))

#+end_src
"<a href=\"org-protocol://brain-id?id=%s\">%s</a>"

We also want the ability to store an ~org-id~ UUID translated /back/ from the =attach-dir=. This will allow us to act upon the source file if we choose to take notes on the video file.

#+begin_src elisp
(defun org-attach-id-from-dir (id)
  "Translate a org-attach dir folder-path back into an UUID ID"
  (format "%s%s"
  (substring id 0 2)
  (substring id 3)))

#+end_src

Do some simple string splitting. This hopefully conforms to the way this kind of information is normally handled in =org-mode/org-media-note=.
#+begin_src elisp
(add-to-list 'org-protocol-protocol-alist
             '("media-link" :protocol "media-link"
               :function media-link-protocol-play-mpv-video))

(defun media-link-protocol-play-mpv-video (info)
  "This handler visualizes the org heading with given id using emacsclient.

    INFO is an alist containing additional information passed by the protocol URL.
    It should contain the id key, pointing to the path of the org id.

      Example protocol string:
      org-protocol://media-link?video=~/org/.attach/27/e2318b-7353-4004-943a-2f1d69b32209/doge_vid420.mpg#0:00:13"
  (when-let ((link (plist-get info :video)))
    (let* ((org-style-link (format "[[video:%s]]" link))
           (splitted (split-string org-style-link "/"))
           (id (format "%s%s"
                       (nth 3 splitted)
                       (nth 4 splitted))))
        ;; (org-link-open-from-string (format "[[video:%s]]" link))
        (setq org-protocol-uuid-from-media-link id)
        (setq org-protocol-last-visited-link org-style-link)
        (org-link-open-from-string org-style-link))
        nil))

  (defun nanjigen/org-media-note-jump-to-note ()
    (interactive)
    (let* ((buffer (org-id-find org-protocol-uuid-from-media-link))
          (link-text (nth 5
                          (split-string org-protocol-last-visited-link "/")))
          (link-text-clean (substring link-text 0 -2)))
      (progn
        (org-id-open org-protocol-uuid-from-media-link t)
        (org-narrow-to-subtree)
        (search-forward link-text-clean)
        (recenter nil))))

(defun media-link-protocol-link-copy ()
  (interactive)
  (org-kill-new (concat "org-protocol://media-link?video="
                        (org-id-copy))))

#+end_src

Now we can use the stored variables and on request open the location of the link in a buffer for note-taking.

See =org-noter--create-session= for inspiration
#+begin_src elisp
(defun nanjigen/org-media-note--create-session ()
  (let* ((notes-buffer
          (make-indirect-buffer)))))
#+end_src

#+begin_src elisp
(defun media-link-protocol-play-cite-video (info)
"This handler visualizes the org heading with given id using emacsclient.

  INFO is an alist containing additional information passed by the protocol URL.
  It should contain the id key, pointing to the path of the org id.

    Example protocol string:
    org-protocol://media-link?videocite=~/org/.attach/27/e2318b-7353-4004-943a-2f1d69b32209/doge_vid420.mpg#0:00:13"
(when-let ((link (plist-get info :videocite)))
  (org-link-open-from-string (format "[[videocite:%s]]" link)))
nil)

(defun media-link-protocol-cite-link-copy ()
  (interactive)
  (org-kill-new (concat "org-protocol://media-link?videocite="
                        (org-media-note--current-org-ref-key))))
#+end_src
org-protocol://media-link?video=https://www.youtube.com/watch?v=lW3eWIj3Q04#0:03:28-0:03:39
org-protocol://org-id?id=4dd04a25-b81d-4da3-b6d0-dc1ba9dd307b
[[org-protocol://org-id/?id=4dd04a25-b81d-4da3-b6d0-dc1ba9dd307b]]
[[org-protocol://org-id?id=4dd04a25-b81d-4da3-b6d0-dc1ba9dd307b]] ;; doesn't work

Because we have defined a regedit, with the right formatting, html links will redirect to the org-protocol handler as well:
#+begin_example html :tangle no
<A href="org-protocol://org-id?id=4dd04a25-b81d-4da3-b6d0-dc1ba9dd307b">Link text here</A>
<A href="org-protocol://org-id?id=4dd04a25-b81d-4da3-b6d0-dc1ba9dd307b">** org-protocol</A>
#+end_example

This can be directly pasted into an element with either =e= (for Questions) or =a= (for Answers) and then =M-<F10>-x-p= (Element pane -> Text -> Paste Html)

Now we can write a key script to automate this process, and bind it to a contextual hydra:

